ember-rails-base-app/backend/app/controllers/api/users_controller.rb

  def index
    return unauthorized unless token_auth
    return forbidden if @tkuser.regular?
    render json: { users: User.all.collect(&:jsonify) }
---
SELECT "users".* FROM "users"

  def create
    user = User.new(user_params)
    user.role = params[:user][:role] if allowed?
    return render json: { user: user.jsonify } if user.save
---
INSERT INTO "users" ("name", "email", "encrypted_password", "tokens", "role", "uid", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    return unauthorized unless token_auth
    return forbidden("You can only update yourself.") if @tkuser.regular? && (@user != @tkuser)
    @user.role = params[:user][:role] unless @tkuser.regular?
    return render json: { user: @user.jsonify } if @user.update(user_params)
---
UPDATE "users" SET "last_sign_in_at" = $1, "current_sign_in_at" = $2, "sign_in_count" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["last_sign_in_at", "2016-07-16 21:28:01.023341"], ["current_sign_in_at", "2016-07-16 21:28:25.055442"], ["sign_in_count", 138], ["updated_at", "2016-07-16 21:28:25.057207"], ["id", 1]]

  def destroy
    @user.destroy if @user == @tkuser || allowed?
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 22]]