ember-rails-base-app/backend/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1
---
  def token_auth
    auth = header_params
    @tkuser = User.find_by_email(auth[:email])